In [1]:
import pandas as pd

# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [8]:
series = pd.Series([4,8,15,16,23,42])

In [10]:
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [15]:
var = [1,2,3,4,5,6,7,8,9,10]

In [17]:
type(var)

list

In [19]:
pd.Series(var)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

# Q3. Create a Pandas DataFrame that contains the following data: 
Then, print the DataFramexample.
Name
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female

In [24]:
df = pd.DataFrame({'Name': ['Alice', 'Bob', 'Claire'],
             'Age': [25, 30, 27],
             'Gender': ['Female', 'Male', 'Female']})

In [26]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [30]:
# A dataframe is a 2D matrix consists of rows and columns while the pandas.series is a type of a list containing only 1D data like an array

In [32]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [36]:
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [38]:
# here type of df is dataframe nad type of series variable is pandas.series

print('df type:', type(df))
print('series type:', type(series))

df type: <class 'pandas.core.frame.DataFrame'>
series type: <class 'pandas.core.series.Series'>

# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

# we can slice the dataframe, we can select multiple columns from a dataframe. If we want to select only first five or first/last n-rows we can use pandas.head(n) or pandas.tail(n). If we want to select few columns from the whole dataframe then we can do that also.

# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [46]:
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [48]:
series[0] = 10

In [50]:
series

0    10
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [52]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [66]:
df['Name'][0] = 'Alice'

C:\Users\iamya\AppData\Local\Temp\ipykernel_17584\3881648321.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][0] = 'Alice'

In [68]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [70]:
df['Name'][0] = 'Yash'

C:\Users\iamya\AppData\Local\Temp\ipykernel_17584\3255894300.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][0] = 'Yash'

In [72]:
df

     Name  Age  Gender
0    Yash   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Both Series and DataFrame is mutable in nature

# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [84]:
name = pd.Series(['Yash', 'Nishant', 'Kush'])
age = pd.Series([24, 23, 23])
education = pd.Series(['B.Tech (CS)', 'B.Sc (CS)', 'BE (Civil)'])

In [90]:
df2 = pd.DataFrame([name, age, education])

In [92]:
df2

             0          1           2
0         Yash    Nishant        Kush
1           24         23          23
2  B.Tech (CS)  B.Sc (CS)  BE (Civil)

In [94]:
type(df2)

pandas.core.frame.DataFrame